Tekla Open API Reference for Tekla Structures 2025
Events.ModelObjectNumberedDelegate Delegate
 The delegate to use for model objects which are numbered. ModelObjects contain only identifier information. If properties need to be checked, Select() for object is required.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void ModelObjectNumberedDelegate(
	List<ModelObject> Objects
)
Public Delegate Sub ModelObjectNumberedDelegate (
	Objects As List(Of ModelObject)
)
Parameters
Objects
Type: System.Collections.Generic.List<ModelObject>
See Also
Reference
Tekla.Structures.Model Namespace